c5/src/Catalogs/Contacts/Contacts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Contacts</name>
  <basedOn>Catalog.Leads</basedOn>
  <owners>Catalog.Companies</owners>
  <owners>Catalog.Organizations</owners>
  <owners>Catalog.Warehouses</owners>
  <owners>Catalog.Leads</owners>
  <attributes>
    <name>AdditionalPhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Birthday</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BusinessPhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Contact</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ContactType</name>
    <type>
      <types>CatalogRef.ContactTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Fax</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>HomePhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Lead</name>
    <type>
      <types>CatalogRef.Leads</types>
    </type>
  </attributes>
  <attributes>
    <name>MobilePhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Salutation</name>
    <type>
      <types>CatalogRef.Salutations</types>
    </type>
  </attributes>
  <attributes>
    <name>Skype</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Twitter</name>
    <type>
      <types>DefinedType.Twitter</types>
    </type>
  </attributes>
  <attributes>
    <name>Web</name>
    <type>
      <types>DefinedType.Web</types>
    </type>
  </attributes>
</mdclass:Catalog>

c5/src/Catalogs/Contacts/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	initPhones ();
	Photos.Load ( ThisObject );
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure initPhones ()
	
	PhoneTemplates.Set ( ThisObject, "AdditionalPhone, BusinessPhone, HomePhone, MobilePhone, Fax" );

EndProcedure 

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	Forms.RedefineOpeningModeForLinux ( ThisObject );
	if ( Object.Ref.IsEmpty () ) then
		initPhones ();
		fillNew ();
		base = Parameters.Basis;
		if ( base <> undefined
			and TypeOf ( base ) = Type ( "CatalogRef.Leads" ) ) then
			FillPropertyValues ( Object, base, , "Creator, Date" );
			Object.Owner = base;
			setName ( Object );
		endif;
	endif; 
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Photo show filled ( Photo );
	|Upload show empty ( Photo )
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure fillNew ()
	
	Object.Creator = SessionParameters.User;
	Object.Date = CurrentSessionDate ();
	
EndProcedure

&AtClient
Procedure BeforeWrite ( Cancel, WriteParameters )
	
	setPresentation ();
	
EndProcedure

&AtClient
Procedure setPresentation ()
	
	parts = new Array ();
	if ( not IsBlankString ( Object.Name ) ) then
		parts.Add ( "" + ? ( Object.Salutation.IsEmpty (), "", "" + Object.Salutation + " " ) + Object.Name );
	endif; 
	if ( not IsBlankString ( Object.Email ) ) then
		parts.Add ( Object.Email );
	endif; 
	if ( not IsBlankString ( Object.MobilePhone ) ) then
		parts.Add ( Object.MobilePhone );
	endif; 
	if ( not Object.ContactType.IsEmpty () ) then
		parts.Add ( "" + Object.ContactType );
	endif; 
	Object.Contact = StrConcat ( parts, ", " );
	Object.Description = Object.Contact;
	
EndProcedure 

&AtServer
Procedure OnWriteAtServer ( Cancel, CurrentObject, WriteParameters )
	
	Photos.Save ( ThisObject, CurrentObject );
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure NameOnChange ( Item )
	
	setName ( Object );
	
EndProcedure

&AtClientAtServerNoContext
Procedure setName ( Object )
	
	Object.Name = ContactsForm.FullName ( Object );
	
EndProcedure 

&AtClient
Procedure PhoneStartChoice ( Item, ChoiceData, StandardProcessing )
	
	PhoneTemplates.Choice ( ThisObject, Item );

EndProcedure

&AtClient
Procedure TwitterOnChange ( Item )
	
	ContactsForm.AdjustTwitter ( Object );
	
EndProcedure

// *****************************************
// *********** Photo

&AtClient
Procedure PhotoClick ( Item, StandardProcessing )
	
	StandardProcessing = false;
	Photos.Upload ( ThisObject );
	
EndProcedure

&AtClient
Procedure Upload ( Command )
	
	Photos.Upload ( ThisObject );
	
EndProcedure

&AtClient
Procedure ClearPhoto ( Command )
	
	Photos.Remove ( ThisObject );
	
EndProcedure
